## save a 2 columns, last 3 rows only.

In [7]:
import pandas as pd
import random

In [3]:
df = pd.read_csv(r"C:\Users\miree\OneDrive\Desktop\diploma AI\AI Course Material\Material\Pandas\4_read_write_to_excel\new.csv")
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [13]:
'''
if I want select just only one column:
rndm_column = random.choice(df.columns)
'''
rndm_column = random.sample(list(df.columns),2)
rndm_column

['27.82', 'larry page']

In [14]:
x = df.loc[-3:,rndm_column]
x

           27.82     larry page
0           4.61           n.a.
1             -1     bill gates
2  not available  mukesh ambani
3            5.6     ratan tata